---
type: ExportDGNSettings
namespace: Autodesk.Revit.DB
version: 2024
members: 7
tags: [revit-api, class]
---

# ExportDGNSettings

`Autodesk.Revit.DB.ExportDGNSettings` · Revit 2024 · 7 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Create | — | `` |
| Method | FindByName | 2018 | `public static ExportDGNSettings FindByName ( Document aDoc , string name )` |
| Method | GetActivePredefinedSettings | 2018 | `public static ExportDGNSettings GetActivePredefinedSettings ( Document aDoc )` |
| Method | GetDGNExportOptions | 2013 | `public DGNExportOptions GetDGNExportOptions ()` |
| Method | ListNames | 2013 | `public static IList < string > ListNames ( Document aDoc )` |
| Method | SetDGNExportOptions | 2013 | `public void SetDGNExportOptions ( DGNExportOptions options )` |
| Property | Parameter | — | `` |